/*!
 * Distpicker v1.0.4
 * https://github.com/fengyuanchen/distpicker
 *
 * Copyright (c) 2014-2016 Fengyuan Chen
 * Released under the MIT license
 *
 * Date: 2016-06-01T15:05:52.606Z
 */

(function (factory) {
  if (typeof define === 'function' && define.amd) {
      // AMD. Register as anonymous module.
    define('ChineseDistricts', [], factory);
  } else {
      // Browser globals.
    factory();
  }
})(function () {

  var ChineseDistricts = {
    86: {
      110000: '大连是的撒尽快答复后开始好地方就爱上收货地址1',
      120000: '北京收货地址2',
      130000: '大连收货地址3'

    },
    110000: {
      110100: '收货联系人11',
      110200: '收货联系人12',
      110300: '收货联系人13'
    },
    110100: {
      110101: '收货联系人111',
      110102: '收货联系人112',
      110103: '收货联系人113',
      110104: '收货联系人114',
    },
    110200:{
      110201: '收货联系人121',
      110202: '收货联系人122',
      110203: '收货联系人123',
      110204: '收货联系人124',
    },
    110300:{
      110301: '收货联系人131',
      110302: '收货联系人132',
      110303: '收货联系人133',
      110304: '收货联系人134',
    },

    120000: {
        120100: '收货联系人21',
        120200: '收货联系人22',
        120300: '收货联系人23'
    },
    120100: {
        120101: '收货联系人211',
        120102: '收货联系人212',
        120103: '收货联系人213',
        120104: '收货联系人214',
    },
    120200:{
        120201: '收货联系人221',
        120202: '收货联系人222',
        120203: '收货联系人223',
        120204: '收货联系人224',
    },
    120300:{
        120301: '收货联系人231',
        120302: '收货联系人232',
        120303: '收货联系人233',
        120304: '收货联系人234',
    }

  };
  var ChineseDistricts2 = {
        86: {
            110000: '提货地址1',
            120000: '提货地址2',
            130000: '提货地址3'

        },
        110000: {
            110100: '收货联系人11',
            110200: '收货联系人12',
            110300: '收货联系人13'
        },
        110100: {
            110101: '收货联系人111',
            110102: '收货联系人112',
            110103: '收货联系人113',
            110104: '收货联系人114',
        },
        110200:{
            110201: '收货联系人121',
            110202: '收货联系人122',
            110203: '收货联系人123',
            110204: '收货联系人124',
        },
        110300:{
            110301: '收货联系人131',
            110302: '收货联系人132',
            110303: '收货联系人133',
            110304: '收货联系人134',
        },

        120000: {
            120100: '收货联系人21',
            120200: '收货联系人22',
            120300: '收货联系人23'
        },
        120100: {
            120101: '收货联系人211',
            120102: '收货联系人212',
            120103: '收货联系人213',
            120104: '收货联系人214',
        },
        120200:{
            120201: '收货联系人221',
            120202: '收货联系人222',
            120203: '收货联系人223',
            120204: '收货联系人224',
        },
        120300:{
            120301: '收货联系人231',
            120302: '收货联系人232',
            120303: '收货联系人233',
            120304: '收货联系人234',
        }

    };

  if (typeof window !== 'undefined') {

      window.ChineseDistricts = ChineseDistricts;
  }

  return ChineseDistricts;

});
